wip/motorbike82M_benchmark/motorbike/system/fvSolution.PCGGAMG
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner {
            preconditioner  GAMG;
            tolerance       1e-07;
            relTol          0.1;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     0;
            cacheAgglomeration on;
            agglomerator    faceAreaPair;
            nCellsInCoarsestLevel 10;
            mergeLevels     2;
        }
        tolerance       1e-07;
        relTol          0.1;
    }
    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
        nSweeps         1;
    }
    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
        nSweeps         1;
    }
    omega
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
        nSweeps         1;
    }
    nuTilda
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relT            0.1;
    }
    Phi
    {
        $p;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent               yes;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    p               0.3;
    U               0.5;
    k               0.7;
    omega           0.7;
    nuTilda         0.5;
}

cache
{
    grad(U)         ;
}


// ************************************************************************* //
